v2206/urban_Microclimate/benchmark_atmSims/atmFlatTerrain/successor/setups.orig/common/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.3;

boundaryField
{
    "p[0-9]+"
    {
        type            freestream;
        freestreamBC
        {
            type        timeVaryingMappedFixedValue;
            offset      0;
            setAverage  off;
            mapMethod   nearest;
            value       $internalField;
        }
        value           $internalField;
    }

    terrain
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }

    top
    {
        type            slip;
    }
}


// ************************************************************************* //
